{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-05-21T19:30:20.941891Z",
     "start_time": "2025-05-21T19:30:19.797027Z"
    }
   },
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd"
   ],
   "outputs": [],
   "execution_count": 19
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T18:57:34.592377Z",
     "start_time": "2025-05-21T18:57:34.572049Z"
    }
   },
   "cell_type": "code",
   "source": "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"abadeus1998\"))",
   "id": "90198b909e18c20a",
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:19:48.735309Z",
     "start_time": "2025-05-21T19:19:48.725017Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def cypher_query_read_executor(query):\n",
    "    with driver.session(database=\"frauddetect\") as session:\n",
    "        return session.execute_read(lambda tx: [record.data() for record in tx.run(query)])\n",
    "    \n",
    "    \n",
    "def cypher_query_write_executor(query, parameters=None):\n",
    "    with driver.session(database=\"frauddetect\") as session:\n",
    "        return session.execute_write(lambda tx: tx.run(query, parameters or {}))\n"
   ],
   "id": "58658005f709147b",
   "outputs": [],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:34:09.002145Z",
     "start_time": "2025-05-21T19:34:08.998707Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_relationships():\n",
    "    query = \"\"\"MATCH (n)-[r]->(m) RETURN DISTINCT labels(n), type(r), labels(m)\"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    return results"
   ],
   "id": "ca290d8be070be28",
   "outputs": [],
   "execution_count": 23
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T18:58:40.655544Z",
     "start_time": "2025-05-21T18:58:40.648926Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_top_clients(tx):\n",
    "    query = \"\"\"\n",
    "    MATCH (c:Client)-[:POSSEDE]->(:Compte)-[:REALISE]->(t:Transaction)\n",
    "    RETURN c.name AS client, COUNT(t) AS nb_transacs ORDER BY nb_transacs DESC LIMIT 10\n",
    "    \"\"\"\n",
    "    return list(tx.run(query))\n"
   ],
   "id": "d67be5a39b10f14e",
   "outputs": [],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:34:13.640351Z",
     "start_time": "2025-05-21T19:34:13.104782Z"
    }
   },
   "cell_type": "code",
   "source": [
    "relations = get_relationships()\n",
    "relations_df = pd.DataFrame(relations)\n",
    "# for row in relations:\n",
    "#     print(row)\n",
    "relations_df"
   ],
   "id": "f0fe6d36f25d012b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                  labels(n)    type(r)                labels(m)\n",
       "0                  [Client]  PERFORMED    [CashIn, Transaction]\n",
       "1     [CashIn, Transaction]         TO               [Merchant]\n",
       "2            [Client, Mule]  PERFORMED  [Transfer, Transaction]\n",
       "3   [Transfer, Transaction]         TO           [Client, Mule]\n",
       "4                  [Client]  PERFORMED   [Payment, Transaction]\n",
       "5    [Payment, Transaction]         TO               [Merchant]\n",
       "6                  [Client]  PERFORMED  [Transfer, Transaction]\n",
       "7                  [Client]  PERFORMED     [Debit, Transaction]\n",
       "8      [Debit, Transaction]         TO                   [Bank]\n",
       "9                  [Client]  PERFORMED   [CashOut, Transaction]\n",
       "10   [CashOut, Transaction]         TO               [Merchant]\n",
       "11  [Transfer, Transaction]         TO                 [Client]\n",
       "12           [Client, Mule]    HAS_SSN                    [SSN]\n",
       "13           [Client, Mule]  HAS_EMAIL                  [Email]\n",
       "14           [Client, Mule]  HAS_PHONE                  [Phone]\n",
       "15                 [Client]    HAS_SSN                    [SSN]\n",
       "16                 [Client]  HAS_EMAIL                  [Email]\n",
       "17                 [Client]  HAS_PHONE                  [Phone]\n",
       "18                 [Client]   FIRST_TX    [CashIn, Transaction]\n",
       "19                 [Client]    LAST_TX    [CashIn, Transaction]\n",
       "20    [CashIn, Transaction]       NEXT    [CashIn, Transaction]\n",
       "21    [CashIn, Transaction]       NEXT   [CashOut, Transaction]\n",
       "22   [CashOut, Transaction]       NEXT   [CashOut, Transaction]\n",
       "23   [CashOut, Transaction]       NEXT    [CashIn, Transaction]\n",
       "24    [CashIn, Transaction]       NEXT  [Transfer, Transaction]\n",
       "25  [Transfer, Transaction]       NEXT    [CashIn, Transaction]\n",
       "26   [CashOut, Transaction]       NEXT   [Payment, Transaction]\n",
       "27   [Payment, Transaction]       NEXT    [CashIn, Transaction]\n",
       "28    [CashIn, Transaction]       NEXT   [Payment, Transaction]\n",
       "29   [Payment, Transaction]       NEXT   [Payment, Transaction]\n",
       "30   [Payment, Transaction]       NEXT     [Debit, Transaction]\n",
       "31     [Debit, Transaction]       NEXT   [Payment, Transaction]\n",
       "32   [Payment, Transaction]       NEXT   [CashOut, Transaction]\n",
       "33   [Payment, Transaction]       NEXT  [Transfer, Transaction]\n",
       "34  [Transfer, Transaction]       NEXT   [Payment, Transaction]\n",
       "35   [CashOut, Transaction]       NEXT  [Transfer, Transaction]\n",
       "36  [Transfer, Transaction]       NEXT   [CashOut, Transaction]\n",
       "37     [Debit, Transaction]       NEXT   [CashOut, Transaction]\n",
       "38     [Debit, Transaction]       NEXT    [CashIn, Transaction]\n",
       "39  [Transfer, Transaction]       NEXT  [Transfer, Transaction]\n",
       "40    [CashIn, Transaction]       NEXT     [Debit, Transaction]\n",
       "41   [CashOut, Transaction]       NEXT     [Debit, Transaction]\n",
       "42     [Debit, Transaction]       NEXT  [Transfer, Transaction]\n",
       "43                 [Client]    LAST_TX   [CashOut, Transaction]\n",
       "44                 [Client]    LAST_TX   [Payment, Transaction]\n",
       "45  [Transfer, Transaction]       NEXT     [Debit, Transaction]\n",
       "46                 [Client]    LAST_TX  [Transfer, Transaction]\n",
       "47     [Debit, Transaction]       NEXT     [Debit, Transaction]\n",
       "48                 [Client]    LAST_TX     [Debit, Transaction]\n",
       "49           [Client, Mule]   FIRST_TX  [Transfer, Transaction]\n",
       "50           [Client, Mule]    LAST_TX  [Transfer, Transaction]\n",
       "51                 [Client]   FIRST_TX   [Payment, Transaction]\n",
       "52                 [Client]   FIRST_TX     [Debit, Transaction]\n",
       "53                 [Client]   FIRST_TX   [CashOut, Transaction]\n",
       "54                 [Client]   FIRST_TX  [Transfer, Transaction]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>labels(n)</th>\n",
       "      <th>type(r)</th>\n",
       "      <th>labels(m)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Merchant]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Client, Mule]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Merchant]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Bank]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Merchant]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Client]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>HAS_SSN</td>\n",
       "      <td>[SSN]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>HAS_EMAIL</td>\n",
       "      <td>[Email]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>HAS_PHONE</td>\n",
       "      <td>[Phone]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>HAS_SSN</td>\n",
       "      <td>[SSN]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>HAS_EMAIL</td>\n",
       "      <td>[Email]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>HAS_PHONE</td>\n",
       "      <td>[Phone]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 24
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "#### 1. Identifier les entités",
   "id": "158da31b3fbf93eb"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:31:25.684798Z",
     "start_time": "2025-05-21T19:31:25.592761Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_entities():\n",
    "    query = \"\"\"MATCH (n) RETURN labels(n) AS type, count(*) AS total ORDER BY total DESC;\"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "entities = get_entities()\n",
    "entities"
   ],
   "id": "472d7e998bb41789",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                       type   total\n",
       "0     [CashIn, Transaction]  149037\n",
       "1    [CashOut, Transaction]   76023\n",
       "2    [Payment, Transaction]   74577\n",
       "3   [Transfer, Transaction]   19460\n",
       "4      [Debit, Transaction]    4392\n",
       "5                     [SSN]    2238\n",
       "6                   [Phone]    2234\n",
       "7                   [Email]    2229\n",
       "8                  [Client]    2000\n",
       "9            [Client, Mule]     433\n",
       "10               [Merchant]     347\n",
       "11                   [Bank]       3"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>total</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>149037</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>76023</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>74577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>19460</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>4392</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[SSN]</td>\n",
       "      <td>2238</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[Phone]</td>\n",
       "      <td>2234</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[Email]</td>\n",
       "      <td>2229</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[Merchant]</td>\n",
       "      <td>347</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[Bank]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 22
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### 2. Recherche de clients actifs avec de nombreuses transactions",
   "id": "93cb7931c25a30d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:39:36.154464Z",
     "start_time": "2025-05-21T19:39:35.320445Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_transactions_list():\n",
    "    query = \"\"\"\n",
    "    MATCH (c:Client)-[:PERFORMED]->(t:Transaction)\n",
    "    RETURN c.name AS client, labels(t) AS types, count(t) AS nb_transactions\n",
    "    ORDER BY nb_transactions DESC;\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "transactions_list = get_transactions_list()\n",
    "transactions_list"
   ],
   "id": "6a818bc91a0904c2",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                client                   types  nb_transactions\n",
       "0       Daniel Hendrix   [CashIn, Transaction]              955\n",
       "1       Isabella Grant   [CashIn, Transaction]              743\n",
       "2         Aubree David   [CashIn, Transaction]              602\n",
       "3       Isabella Grant  [CashOut, Transaction]              550\n",
       "4         Evelyn Craig   [CashIn, Transaction]              532\n",
       "...                ...                     ...              ...\n",
       "9324       Stella Beck    [Debit, Transaction]                1\n",
       "9325     Ellie Russell    [Debit, Transaction]                1\n",
       "9326      Bella Little    [Debit, Transaction]                1\n",
       "9327       Levi Bolton    [Debit, Transaction]                1\n",
       "9328  Jeremiah Burnett    [Debit, Transaction]                1\n",
       "\n",
       "[9329 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>types</th>\n",
       "      <th>nb_transactions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Daniel Hendrix</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>955</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Isabella Grant</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aubree David</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>602</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Isabella Grant</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Evelyn Craig</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>532</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9324</th>\n",
       "      <td>Stella Beck</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9325</th>\n",
       "      <td>Ellie Russell</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9326</th>\n",
       "      <td>Bella Little</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9327</th>\n",
       "      <td>Levi Bolton</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9328</th>\n",
       "      <td>Jeremiah Burnett</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>9329 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 25
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### 3. Chaînes de transactions (chemins entre clients)\n",
   "id": "f9f1a12ef1467f5c"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:52:03.735559Z",
     "start_time": "2025-05-21T19:52:01.068448Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_transactions_strings():\n",
    "    query=\"\"\"MATCH path = (c1:Client)-[:PERFORMED]->(t1:Transfer)-[:TO]-> (c2:Client)-[:PERFORMED]->(t2:Transfer)-[:TO]->(c3:Client)\n",
    "    RETURN path\"\"\"\n",
    "    query_1 = \"\"\"\n",
    "    MATCH path = (c:Client)-[:PERFORMED]->(:Transfer)-[:TO*1..3]->(other:Client)\n",
    "    RETURN path\"\"\"\n",
    "    results = cypher_query_read_executor(query_1)\n",
    "    results_df = pd.DataFrame.from_dict(results)\n",
    "    return results_df\n",
    "\n",
    "transactions_strings = get_transactions_strings()\n",
    "transactions_strings"
   ],
   "id": "9fec1ab8504995e4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                                                    path\n",
       "0      [{'name': 'Dylan Hunt', 'id': '478095878033882...\n",
       "1      [{'name': 'Serenity Jacobson', 'id': '46223573...\n",
       "2      [{'name': 'Brooklyn Harper', 'id': '4805783504...\n",
       "3      [{'name': 'Claire Witt', 'id': '46549092099387...\n",
       "4      [{'name': 'Oliver Daniel', 'id': '486800889836...\n",
       "...                                                  ...\n",
       "19455  [{'name': 'Michael Herman', 'id': '49958758099...\n",
       "19456  [{'name': 'Ella Bush', 'id': '4025060919204955...\n",
       "19457  [{'name': 'Elijah Byers', 'id': '4708996503243...\n",
       "19458  [{'name': 'Adrian Carney', 'id': '492824416937...\n",
       "19459  [{'name': 'Ariana Grant', 'id': '4850134858807...\n",
       "\n",
       "[19460 rows x 1 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>path</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[{'name': 'Dylan Hunt', 'id': '478095878033882...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[{'name': 'Serenity Jacobson', 'id': '46223573...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[{'name': 'Brooklyn Harper', 'id': '4805783504...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[{'name': 'Claire Witt', 'id': '46549092099387...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[{'name': 'Oliver Daniel', 'id': '486800889836...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19455</th>\n",
       "      <td>[{'name': 'Michael Herman', 'id': '49958758099...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19456</th>\n",
       "      <td>[{'name': 'Ella Bush', 'id': '4025060919204955...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19457</th>\n",
       "      <td>[{'name': 'Elijah Byers', 'id': '4708996503243...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19458</th>\n",
       "      <td>[{'name': 'Adrian Carney', 'id': '492824416937...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19459</th>\n",
       "      <td>[{'name': 'Ariana Grant', 'id': '4850134858807...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>19460 rows × 1 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 31
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### 4. Clients communs à plusieurs marchands",
   "id": "966f5fcb4748b5b6"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T20:12:45.709489Z",
     "start_time": "2025-05-21T20:12:45.105331Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def common_clients_to_merchants():\n",
    "    query=\"\"\"\n",
    "    MATCH (c:Client)-[:PERFORMED]->(t)-[:TO]->  (m:Merchant)\n",
    "    WITH c, COLLECT(DISTINCT m) as merchants\n",
    "    WHERE SIZE(merchants) > 1\n",
    "    RETURN c.name as client, SIZE(merchants) as nb_merchants\n",
    "    ORDER BY nb_merchants DESC\"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "merch_clients = common_clients_to_merchants()\n",
    "merch_clients"
   ],
   "id": "7ed046859298755e",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                   client  nb_merchants\n",
       "0          Daniel Hendrix           346\n",
       "1          Isabella Grant           344\n",
       "2            Aubree David           337\n",
       "3            Andrea Sweet           330\n",
       "4          Michael Cooper           330\n",
       "...                   ...           ...\n",
       "1992       Adrian Hensley             2\n",
       "1993      Audrey Atkinson             2\n",
       "1994         Violet Marks             2\n",
       "1995  Christopher Bradley             2\n",
       "1996        Peyton Farmer             2\n",
       "\n",
       "[1997 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>nb_merchants</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Daniel Hendrix</td>\n",
       "      <td>346</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Isabella Grant</td>\n",
       "      <td>344</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aubree David</td>\n",
       "      <td>337</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Andrea Sweet</td>\n",
       "      <td>330</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Michael Cooper</td>\n",
       "      <td>330</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1992</th>\n",
       "      <td>Adrian Hensley</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1993</th>\n",
       "      <td>Audrey Atkinson</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1994</th>\n",
       "      <td>Violet Marks</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1995</th>\n",
       "      <td>Christopher Bradley</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1996</th>\n",
       "      <td>Peyton Farmer</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1997 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 35
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:30:01.521508Z",
     "start_time": "2025-05-21T21:30:01.429438Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def create_client_graph():\n",
    "    query = \"\"\"\n",
    "    CALL gds.graph.project.cypher(\n",
    "    'clientGraph1',\n",
    "    'MATCH (c:Client) RETURN id(c) AS id',\n",
    "    '\n",
    "    MATCH (c1:Client)-[:PERFORMED]->(t:Transaction)<-[:TO]-(c2:Client)\n",
    "    WHERE c1 <> c2\n",
    "    RETURN id(c1) AS source, id(c2) AS target\n",
    "    '\n",
    "    )\n",
    "    \"\"\"\n",
    "    graph_result = cypher_query_read_executor(query)\n",
    "    return graph_result\n",
    "\n",
    "client_graph = create_client_graph()"
   ],
   "id": "bbabc189681c9a38",
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated procedure. ('gds.graph.project.cypher' has been replaced by 'gds.graph.project Cypher projection as an aggregation function')} {position: line: 2, column: 5, offset: 5} for query: \"\\n    CALL gds.graph.project.cypher(\\n    'clientGraph1',\\n    'MATCH (c:Client) RETURN id(c) AS id',\\n    '\\n    MATCH (c1:Client)-[:PERFORMED]->(t:Transaction)<-[:TO]-(c2:Client)\\n    WHERE c1 <> c2\\n    RETURN id(c1) AS source, id(c2) AS target\\n    '\\n    )\\n    \"\n"
     ]
    }
   ],
   "execution_count": 48
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Partie 5 : Détection de communautés (Louvain)",
   "id": "e1f03fe4597b15cd"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:30:45.928509Z",
     "start_time": "2025-05-21T21:30:45.766088Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def detect_communities():\n",
    "    query = \"\"\"\n",
    "    CALL gds.louvain.stream('clientGraph1')\n",
    "    YIELD nodeId, communityId\n",
    "    RETURN gds.util.asNode(nodeId).name AS client, communityId\n",
    "    ORDER BY communityId DESC\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "communities = detect_communities()\n",
    "communities"
   ],
   "id": "116931cde614803f",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                  client  communityId\n",
       "0        Adrian Jacobson         2432\n",
       "1     Katherine Jacobson         2431\n",
       "2        Nathaniel Myers         2430\n",
       "3           Xavier Welch         2429\n",
       "4          Elijah Warren         2428\n",
       "...                  ...          ...\n",
       "2428         Lauren Mack            4\n",
       "2429        Landon Adams            3\n",
       "2430        Faith Dotson            2\n",
       "2431       Dominic Boyer            1\n",
       "2432        Bentley Peck            0\n",
       "\n",
       "[2433 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>communityId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Adrian Jacobson</td>\n",
       "      <td>2432</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Katherine Jacobson</td>\n",
       "      <td>2431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nathaniel Myers</td>\n",
       "      <td>2430</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Xavier Welch</td>\n",
       "      <td>2429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Elijah Warren</td>\n",
       "      <td>2428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2428</th>\n",
       "      <td>Lauren Mack</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2429</th>\n",
       "      <td>Landon Adams</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2430</th>\n",
       "      <td>Faith Dotson</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2431</th>\n",
       "      <td>Dominic Boyer</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2432</th>\n",
       "      <td>Bentley Peck</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2433 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 49
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:30:54.049553Z",
     "start_time": "2025-05-21T21:30:53.905944Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def write_communities():\n",
    "    query = \"\"\"\n",
    "    CALL gds.louvain.write('clientGraph1', { writeProperty: 'community' })\n",
    "    YIELD communityCount, modularity\n",
    "    \"\"\"\n",
    "    results = cypher_query_write_executor(query)\n",
    "    # results_df = pd.DataFrame.from_records(results)\n",
    "    return results\n",
    "\n",
    "com_writing = write_communities()\n",
    "com_writing"
   ],
   "id": "9ccf8b480104c985",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1f894017500>"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 50
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:31:06.624495Z",
     "start_time": "2025-05-21T21:31:06.533366Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def show_communities():\n",
    "    query = \"\"\"\n",
    "    MATCH (c:Client)\n",
    "    RETURN c.name, c.community\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "client_communities = show_communities()\n",
    "client_communities"
   ],
   "id": "fd48a9ad4fb415fa",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                  c.name  c.community\n",
       "0           Bentley Peck            0\n",
       "1          Dominic Boyer            1\n",
       "2           Faith Dotson            2\n",
       "3           Landon Adams            3\n",
       "4            Lauren Mack            4\n",
       "...                  ...          ...\n",
       "2428       Elijah Warren         2428\n",
       "2429        Xavier Welch         2429\n",
       "2430     Nathaniel Myers         2430\n",
       "2431  Katherine Jacobson         2431\n",
       "2432     Adrian Jacobson         2432\n",
       "\n",
       "[2433 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c.name</th>\n",
       "      <th>c.community</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bentley Peck</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dominic Boyer</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Faith Dotson</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Landon Adams</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lauren Mack</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2428</th>\n",
       "      <td>Elijah Warren</td>\n",
       "      <td>2428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2429</th>\n",
       "      <td>Xavier Welch</td>\n",
       "      <td>2429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2430</th>\n",
       "      <td>Nathaniel Myers</td>\n",
       "      <td>2430</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2431</th>\n",
       "      <td>Katherine Jacobson</td>\n",
       "      <td>2431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2432</th>\n",
       "      <td>Adrian Jacobson</td>\n",
       "      <td>2432</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2433 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 51
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### page rank",
   "id": "99036c0e00cfd7bb"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:31:18.924092Z",
     "start_time": "2025-05-21T21:31:18.803580Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def detect_suspect_nodes_with_pagerank():\n",
    "    query = \"\"\"\n",
    "    CALL gds.pageRank.stream('clientGraph1')\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).name AS client, score\n",
    "    ORDER BY score DESC\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "suspect_nodes_w_pagerank = detect_suspect_nodes_with_pagerank()\n",
    "suspect_nodes_w_pagerank"
   ],
   "id": "c6645e0011fc8a10",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "              client  score\n",
       "0       Bentley Peck   0.15\n",
       "1      Dominic Boyer   0.15\n",
       "2       Faith Dotson   0.15\n",
       "3       Landon Adams   0.15\n",
       "4        Lauren Mack   0.15\n",
       "...              ...    ...\n",
       "2428    Samuel Ellis   0.15\n",
       "2429    Alexa Rhodes   0.15\n",
       "2430  Ariana Charles   0.15\n",
       "2431     Zoey Mendez   0.15\n",
       "2432      Dylan Gray   0.15\n",
       "\n",
       "[2433 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bentley Peck</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dominic Boyer</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Faith Dotson</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Landon Adams</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lauren Mack</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2428</th>\n",
       "      <td>Samuel Ellis</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2429</th>\n",
       "      <td>Alexa Rhodes</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2430</th>\n",
       "      <td>Ariana Charles</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2431</th>\n",
       "      <td>Zoey Mendez</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2432</th>\n",
       "      <td>Dylan Gray</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2433 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 52
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:31:33.019844Z",
     "start_time": "2025-05-21T21:31:32.850879Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def detect_suspect_nodes_with_betweenness():\n",
    "    query = \"\"\"\n",
    "    CALL gds.betweenness.stream('clientGraph1')\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).name AS client, score\n",
    "    ORDER BY score DESC\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "suspect_nodes_w_betweenness = detect_suspect_nodes_with_betweenness()\n",
    "suspect_nodes_w_betweenness"
   ],
   "id": "f52f65ae579c94fc",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "              client  score\n",
       "0       Bentley Peck    0.0\n",
       "1      Dominic Boyer    0.0\n",
       "2       Faith Dotson    0.0\n",
       "3       Landon Adams    0.0\n",
       "4        Lauren Mack    0.0\n",
       "...              ...    ...\n",
       "2428    Samuel Ellis    0.0\n",
       "2429    Alexa Rhodes    0.0\n",
       "2430  Ariana Charles    0.0\n",
       "2431     Zoey Mendez    0.0\n",
       "2432      Dylan Gray    0.0\n",
       "\n",
       "[2433 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bentley Peck</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dominic Boyer</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Faith Dotson</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Landon Adams</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lauren Mack</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2428</th>\n",
       "      <td>Samuel Ellis</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2429</th>\n",
       "      <td>Alexa Rhodes</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2430</th>\n",
       "      <td>Ariana Charles</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2431</th>\n",
       "      <td>Zoey Mendez</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2432</th>\n",
       "      <td>Dylan Gray</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2433 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 53
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### 7-Similarity comparison",
   "id": "f3b52d899694203b"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:31:38.149719Z",
     "start_time": "2025-05-21T21:31:38.110759Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def similarity_comparison():\n",
    "    query = \"\"\"\n",
    "    CALL gds.nodeSimilarity.stream('clientGraph1')\n",
    "    YIELD node1, node2, similarity\n",
    "    RETURN\n",
    "    gds.util.asNode(node1).name AS client1,\n",
    "    gds.util.asNode(node2).name AS client2,\n",
    "    similarity\n",
    "    ORDER BY similarity DESC\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "similarities = similarity_comparison()\n",
    "similarities"
   ],
   "id": "53a2321b3e28ff71",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 54
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "d96272feb487a9b4"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
