{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-05-21T23:42:58.042999Z",
     "start_time": "2025-05-21T23:42:57.459251Z"
    }
   },
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import networkx as nx\n",
    "import plotly.graph_objects as go\n",
    "\n",
    "import plotly.io as pio\n",
    "pio.renderers.default = 'notebook'\n"
   ],
   "outputs": [],
   "execution_count": 74
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T18:57:34.592377Z",
     "start_time": "2025-05-21T18:57:34.572049Z"
    }
   },
   "cell_type": "code",
   "source": "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"abadeus1998\"))",
   "id": "90198b909e18c20a",
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:19:48.735309Z",
     "start_time": "2025-05-21T19:19:48.725017Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def cypher_query_read_executor(query):\n",
    "    with driver.session(database=\"frauddetect\") as session:\n",
    "        return session.execute_read(lambda tx: [record.data() for record in tx.run(query)])\n",
    "    \n",
    "    \n",
    "def cypher_query_write_executor(query, parameters=None):\n",
    "    with driver.session(database=\"frauddetect\") as session:\n",
    "        return session.execute_write(lambda tx: tx.run(query, parameters or {}))\n"
   ],
   "id": "58658005f709147b",
   "outputs": [],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:34:09.002145Z",
     "start_time": "2025-05-21T19:34:08.998707Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_relationships():\n",
    "    query = \"\"\"MATCH (n)-[r]->(m) RETURN DISTINCT labels(n), type(r), labels(m)\"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    return results"
   ],
   "id": "ca290d8be070be28",
   "outputs": [],
   "execution_count": 23
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T18:58:40.655544Z",
     "start_time": "2025-05-21T18:58:40.648926Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_top_clients(tx):\n",
    "    query = \"\"\"\n",
    "    MATCH (c:Client)-[:POSSEDE]->(:Compte)-[:REALISE]->(t:Transaction)\n",
    "    RETURN c.name AS client, COUNT(t) AS nb_transacs ORDER BY nb_transacs DESC LIMIT 10\n",
    "    \"\"\"\n",
    "    return list(tx.run(query))\n"
   ],
   "id": "d67be5a39b10f14e",
   "outputs": [],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:34:13.640351Z",
     "start_time": "2025-05-21T19:34:13.104782Z"
    }
   },
   "cell_type": "code",
   "source": [
    "relations = get_relationships()\n",
    "relations_df = pd.DataFrame(relations)\n",
    "# for row in relations:\n",
    "#     print(row)\n",
    "relations_df"
   ],
   "id": "f0fe6d36f25d012b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                  labels(n)    type(r)                labels(m)\n",
       "0                  [Client]  PERFORMED    [CashIn, Transaction]\n",
       "1     [CashIn, Transaction]         TO               [Merchant]\n",
       "2            [Client, Mule]  PERFORMED  [Transfer, Transaction]\n",
       "3   [Transfer, Transaction]         TO           [Client, Mule]\n",
       "4                  [Client]  PERFORMED   [Payment, Transaction]\n",
       "5    [Payment, Transaction]         TO               [Merchant]\n",
       "6                  [Client]  PERFORMED  [Transfer, Transaction]\n",
       "7                  [Client]  PERFORMED     [Debit, Transaction]\n",
       "8      [Debit, Transaction]         TO                   [Bank]\n",
       "9                  [Client]  PERFORMED   [CashOut, Transaction]\n",
       "10   [CashOut, Transaction]         TO               [Merchant]\n",
       "11  [Transfer, Transaction]         TO                 [Client]\n",
       "12           [Client, Mule]    HAS_SSN                    [SSN]\n",
       "13           [Client, Mule]  HAS_EMAIL                  [Email]\n",
       "14           [Client, Mule]  HAS_PHONE                  [Phone]\n",
       "15                 [Client]    HAS_SSN                    [SSN]\n",
       "16                 [Client]  HAS_EMAIL                  [Email]\n",
       "17                 [Client]  HAS_PHONE                  [Phone]\n",
       "18                 [Client]   FIRST_TX    [CashIn, Transaction]\n",
       "19                 [Client]    LAST_TX    [CashIn, Transaction]\n",
       "20    [CashIn, Transaction]       NEXT    [CashIn, Transaction]\n",
       "21    [CashIn, Transaction]       NEXT   [CashOut, Transaction]\n",
       "22   [CashOut, Transaction]       NEXT   [CashOut, Transaction]\n",
       "23   [CashOut, Transaction]       NEXT    [CashIn, Transaction]\n",
       "24    [CashIn, Transaction]       NEXT  [Transfer, Transaction]\n",
       "25  [Transfer, Transaction]       NEXT    [CashIn, Transaction]\n",
       "26   [CashOut, Transaction]       NEXT   [Payment, Transaction]\n",
       "27   [Payment, Transaction]       NEXT    [CashIn, Transaction]\n",
       "28    [CashIn, Transaction]       NEXT   [Payment, Transaction]\n",
       "29   [Payment, Transaction]       NEXT   [Payment, Transaction]\n",
       "30   [Payment, Transaction]       NEXT     [Debit, Transaction]\n",
       "31     [Debit, Transaction]       NEXT   [Payment, Transaction]\n",
       "32   [Payment, Transaction]       NEXT   [CashOut, Transaction]\n",
       "33   [Payment, Transaction]       NEXT  [Transfer, Transaction]\n",
       "34  [Transfer, Transaction]       NEXT   [Payment, Transaction]\n",
       "35   [CashOut, Transaction]       NEXT  [Transfer, Transaction]\n",
       "36  [Transfer, Transaction]       NEXT   [CashOut, Transaction]\n",
       "37     [Debit, Transaction]       NEXT   [CashOut, Transaction]\n",
       "38     [Debit, Transaction]       NEXT    [CashIn, Transaction]\n",
       "39  [Transfer, Transaction]       NEXT  [Transfer, Transaction]\n",
       "40    [CashIn, Transaction]       NEXT     [Debit, Transaction]\n",
       "41   [CashOut, Transaction]       NEXT     [Debit, Transaction]\n",
       "42     [Debit, Transaction]       NEXT  [Transfer, Transaction]\n",
       "43                 [Client]    LAST_TX   [CashOut, Transaction]\n",
       "44                 [Client]    LAST_TX   [Payment, Transaction]\n",
       "45  [Transfer, Transaction]       NEXT     [Debit, Transaction]\n",
       "46                 [Client]    LAST_TX  [Transfer, Transaction]\n",
       "47     [Debit, Transaction]       NEXT     [Debit, Transaction]\n",
       "48                 [Client]    LAST_TX     [Debit, Transaction]\n",
       "49           [Client, Mule]   FIRST_TX  [Transfer, Transaction]\n",
       "50           [Client, Mule]    LAST_TX  [Transfer, Transaction]\n",
       "51                 [Client]   FIRST_TX   [Payment, Transaction]\n",
       "52                 [Client]   FIRST_TX     [Debit, Transaction]\n",
       "53                 [Client]   FIRST_TX   [CashOut, Transaction]\n",
       "54                 [Client]   FIRST_TX  [Transfer, Transaction]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>labels(n)</th>\n",
       "      <th>type(r)</th>\n",
       "      <th>labels(m)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Merchant]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Client, Mule]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Merchant]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Bank]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>PERFORMED</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Merchant]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>TO</td>\n",
       "      <td>[Client]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>HAS_SSN</td>\n",
       "      <td>[SSN]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>HAS_EMAIL</td>\n",
       "      <td>[Email]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>HAS_PHONE</td>\n",
       "      <td>[Phone]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>HAS_SSN</td>\n",
       "      <td>[SSN]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>HAS_EMAIL</td>\n",
       "      <td>[Email]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>HAS_PHONE</td>\n",
       "      <td>[Phone]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>NEXT</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>LAST_TX</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>FIRST_TX</td>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 24
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "#### 1. Identifier les entités",
   "id": "158da31b3fbf93eb"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:31:25.684798Z",
     "start_time": "2025-05-21T19:31:25.592761Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_entities():\n",
    "    query = \"\"\"MATCH (n) RETURN labels(n) AS type, count(*) AS total ORDER BY total DESC;\"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "entities = get_entities()\n",
    "entities"
   ],
   "id": "472d7e998bb41789",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                       type   total\n",
       "0     [CashIn, Transaction]  149037\n",
       "1    [CashOut, Transaction]   76023\n",
       "2    [Payment, Transaction]   74577\n",
       "3   [Transfer, Transaction]   19460\n",
       "4      [Debit, Transaction]    4392\n",
       "5                     [SSN]    2238\n",
       "6                   [Phone]    2234\n",
       "7                   [Email]    2229\n",
       "8                  [Client]    2000\n",
       "9            [Client, Mule]     433\n",
       "10               [Merchant]     347\n",
       "11                   [Bank]       3"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>total</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>149037</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>76023</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[Payment, Transaction]</td>\n",
       "      <td>74577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[Transfer, Transaction]</td>\n",
       "      <td>19460</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>4392</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[SSN]</td>\n",
       "      <td>2238</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[Phone]</td>\n",
       "      <td>2234</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[Email]</td>\n",
       "      <td>2229</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[Client]</td>\n",
       "      <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[Client, Mule]</td>\n",
       "      <td>433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[Merchant]</td>\n",
       "      <td>347</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[Bank]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 22
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### 2. Recherche de clients actifs avec de nombreuses transactions",
   "id": "93cb7931c25a30d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:39:36.154464Z",
     "start_time": "2025-05-21T19:39:35.320445Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_transactions_list():\n",
    "    query = \"\"\"\n",
    "    MATCH (c:Client)-[:PERFORMED]->(t:Transaction)\n",
    "    RETURN c.name AS client, labels(t) AS types, count(t) AS nb_transactions\n",
    "    ORDER BY nb_transactions DESC;\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "transactions_list = get_transactions_list()\n",
    "transactions_list"
   ],
   "id": "6a818bc91a0904c2",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                client                   types  nb_transactions\n",
       "0       Daniel Hendrix   [CashIn, Transaction]              955\n",
       "1       Isabella Grant   [CashIn, Transaction]              743\n",
       "2         Aubree David   [CashIn, Transaction]              602\n",
       "3       Isabella Grant  [CashOut, Transaction]              550\n",
       "4         Evelyn Craig   [CashIn, Transaction]              532\n",
       "...                ...                     ...              ...\n",
       "9324       Stella Beck    [Debit, Transaction]                1\n",
       "9325     Ellie Russell    [Debit, Transaction]                1\n",
       "9326      Bella Little    [Debit, Transaction]                1\n",
       "9327       Levi Bolton    [Debit, Transaction]                1\n",
       "9328  Jeremiah Burnett    [Debit, Transaction]                1\n",
       "\n",
       "[9329 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>types</th>\n",
       "      <th>nb_transactions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Daniel Hendrix</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>955</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Isabella Grant</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aubree David</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>602</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Isabella Grant</td>\n",
       "      <td>[CashOut, Transaction]</td>\n",
       "      <td>550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Evelyn Craig</td>\n",
       "      <td>[CashIn, Transaction]</td>\n",
       "      <td>532</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9324</th>\n",
       "      <td>Stella Beck</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9325</th>\n",
       "      <td>Ellie Russell</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9326</th>\n",
       "      <td>Bella Little</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9327</th>\n",
       "      <td>Levi Bolton</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9328</th>\n",
       "      <td>Jeremiah Burnett</td>\n",
       "      <td>[Debit, Transaction]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>9329 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 25
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### 3. Chaînes de transactions (chemins entre clients)\n",
   "id": "f9f1a12ef1467f5c"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T19:52:03.735559Z",
     "start_time": "2025-05-21T19:52:01.068448Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_transactions_strings():\n",
    "    query=\"\"\"MATCH path = (c1:Client)-[:PERFORMED]->(t1:Transfer)-[:TO]-> (c2:Client)-[:PERFORMED]->(t2:Transfer)-[:TO]->(c3:Client)\n",
    "    RETURN path\"\"\"\n",
    "    query_1 = \"\"\"\n",
    "    MATCH path = (c:Client)-[:PERFORMED]->(:Transfer)-[:TO*1..3]->(other:Client)\n",
    "    RETURN path\"\"\"\n",
    "    results = cypher_query_read_executor(query_1)\n",
    "    results_df = pd.DataFrame.from_dict(results)\n",
    "    return results_df\n",
    "\n",
    "transactions_strings = get_transactions_strings()\n",
    "transactions_strings"
   ],
   "id": "9fec1ab8504995e4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                                                    path\n",
       "0      [{'name': 'Dylan Hunt', 'id': '478095878033882...\n",
       "1      [{'name': 'Serenity Jacobson', 'id': '46223573...\n",
       "2      [{'name': 'Brooklyn Harper', 'id': '4805783504...\n",
       "3      [{'name': 'Claire Witt', 'id': '46549092099387...\n",
       "4      [{'name': 'Oliver Daniel', 'id': '486800889836...\n",
       "...                                                  ...\n",
       "19455  [{'name': 'Michael Herman', 'id': '49958758099...\n",
       "19456  [{'name': 'Ella Bush', 'id': '4025060919204955...\n",
       "19457  [{'name': 'Elijah Byers', 'id': '4708996503243...\n",
       "19458  [{'name': 'Adrian Carney', 'id': '492824416937...\n",
       "19459  [{'name': 'Ariana Grant', 'id': '4850134858807...\n",
       "\n",
       "[19460 rows x 1 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>path</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[{'name': 'Dylan Hunt', 'id': '478095878033882...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[{'name': 'Serenity Jacobson', 'id': '46223573...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[{'name': 'Brooklyn Harper', 'id': '4805783504...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[{'name': 'Claire Witt', 'id': '46549092099387...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[{'name': 'Oliver Daniel', 'id': '486800889836...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19455</th>\n",
       "      <td>[{'name': 'Michael Herman', 'id': '49958758099...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19456</th>\n",
       "      <td>[{'name': 'Ella Bush', 'id': '4025060919204955...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19457</th>\n",
       "      <td>[{'name': 'Elijah Byers', 'id': '4708996503243...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19458</th>\n",
       "      <td>[{'name': 'Adrian Carney', 'id': '492824416937...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19459</th>\n",
       "      <td>[{'name': 'Ariana Grant', 'id': '4850134858807...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>19460 rows × 1 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 31
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### 4. Clients communs à plusieurs marchands",
   "id": "966f5fcb4748b5b6"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T20:12:45.709489Z",
     "start_time": "2025-05-21T20:12:45.105331Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def common_clients_to_merchants():\n",
    "    query=\"\"\"\n",
    "    MATCH (c:Client)-[:PERFORMED]->(t)-[:TO]->  (m:Merchant)\n",
    "    WITH c, COLLECT(DISTINCT m) as merchants\n",
    "    WHERE SIZE(merchants) > 1\n",
    "    RETURN c.name as client, SIZE(merchants) as nb_merchants\n",
    "    ORDER BY nb_merchants DESC\"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "merch_clients = common_clients_to_merchants()\n",
    "merch_clients"
   ],
   "id": "7ed046859298755e",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                   client  nb_merchants\n",
       "0          Daniel Hendrix           346\n",
       "1          Isabella Grant           344\n",
       "2            Aubree David           337\n",
       "3            Andrea Sweet           330\n",
       "4          Michael Cooper           330\n",
       "...                   ...           ...\n",
       "1992       Adrian Hensley             2\n",
       "1993      Audrey Atkinson             2\n",
       "1994         Violet Marks             2\n",
       "1995  Christopher Bradley             2\n",
       "1996        Peyton Farmer             2\n",
       "\n",
       "[1997 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>nb_merchants</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Daniel Hendrix</td>\n",
       "      <td>346</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Isabella Grant</td>\n",
       "      <td>344</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aubree David</td>\n",
       "      <td>337</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Andrea Sweet</td>\n",
       "      <td>330</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Michael Cooper</td>\n",
       "      <td>330</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1992</th>\n",
       "      <td>Adrian Hensley</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1993</th>\n",
       "      <td>Audrey Atkinson</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1994</th>\n",
       "      <td>Violet Marks</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1995</th>\n",
       "      <td>Christopher Bradley</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1996</th>\n",
       "      <td>Peyton Farmer</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1997 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 35
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "#### Checking if my clients are connected via the transactions",
   "id": "600e448bbb40b9ee"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "# query = \"\"\"\n",
    "#     MATCH (c1:Client)-[:PERFORMED]->(:Transaction)<-[:TO]-(c2:Client)\n",
    "#     WHERE c1 <> c2\n",
    "#     RETURN c1.name AS sourceClient, c2.name AS targetClient\n",
    "#     LIMIT 10\n",
    "#     \"\"\""
   ],
   "id": "aa673c7e9db45698"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Since no client directly transfer cash to other clients we have o find another way to detet fraudulent transaxions",
   "id": "5dda455903e5b3a3"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "#### Check if Clients Share Emails, Phones, SSNs",
   "id": "74fcb0015d81e203"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T22:30:31.029093Z",
     "start_time": "2025-05-21T22:30:30.891843Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def linked_through_ssn():\n",
    "    query = \"\"\"\n",
    "    MATCH (c1:Client)-[:HAS_SSN]->(ssn:SSN)<-[:HAS_SSN]-(c2:Client)\n",
    "    WHERE c1 <> c2\n",
    "    RETURN c1.name AS Client1, c2.name AS Client2, ssn.ssn AS SharedSSN\n",
    "    ORDER BY SharedSSN\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "ssn_linked = linked_through_ssn()\n",
    "ssn_linked"
   ],
   "id": "be5da57095903fe1",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "               Client1          Client2    SharedSSN\n",
       "0        Caleb Holland        Ian Short  022-40-7485\n",
       "1         London Perry        Ian Short  022-40-7485\n",
       "2            Ian Short    Caleb Holland  022-40-7485\n",
       "3         London Perry    Caleb Holland  022-40-7485\n",
       "4            Ian Short     London Perry  022-40-7485\n",
       "..                 ...              ...          ...\n",
       "685         Jose Colon     Kaylee Owens  897-40-1618\n",
       "686    Ryder Mcconnell     Kaylee Owens  897-40-1618\n",
       "687  Nathan Stephenson  Ryder Mcconnell  897-40-1618\n",
       "688         Jose Colon  Ryder Mcconnell  897-40-1618\n",
       "689       Kaylee Owens  Ryder Mcconnell  897-40-1618\n",
       "\n",
       "[690 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Client1</th>\n",
       "      <th>Client2</th>\n",
       "      <th>SharedSSN</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Caleb Holland</td>\n",
       "      <td>Ian Short</td>\n",
       "      <td>022-40-7485</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>London Perry</td>\n",
       "      <td>Ian Short</td>\n",
       "      <td>022-40-7485</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Ian Short</td>\n",
       "      <td>Caleb Holland</td>\n",
       "      <td>022-40-7485</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>London Perry</td>\n",
       "      <td>Caleb Holland</td>\n",
       "      <td>022-40-7485</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Ian Short</td>\n",
       "      <td>London Perry</td>\n",
       "      <td>022-40-7485</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>685</th>\n",
       "      <td>Jose Colon</td>\n",
       "      <td>Kaylee Owens</td>\n",
       "      <td>897-40-1618</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>686</th>\n",
       "      <td>Ryder Mcconnell</td>\n",
       "      <td>Kaylee Owens</td>\n",
       "      <td>897-40-1618</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>687</th>\n",
       "      <td>Nathan Stephenson</td>\n",
       "      <td>Ryder Mcconnell</td>\n",
       "      <td>897-40-1618</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>688</th>\n",
       "      <td>Jose Colon</td>\n",
       "      <td>Ryder Mcconnell</td>\n",
       "      <td>897-40-1618</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>689</th>\n",
       "      <td>Kaylee Owens</td>\n",
       "      <td>Ryder Mcconnell</td>\n",
       "      <td>897-40-1618</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>690 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 61
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T22:21:10.189047Z",
     "start_time": "2025-05-21T22:21:10.183886Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def relations_shared_between_clients(link_type,relation_type):\n",
    "    query = f\"\"\"\n",
    "    MATCH (c1:Client)-[:{relation_type}]->(p:{link_type})<-[:{relation_type}]-(c2:Client)\n",
    "    WHERE c1 <> c2\n",
    "    RETURN c1.name, c2.name\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df"
   ],
   "id": "24f9aa92479382b1",
   "outputs": [],
   "execution_count": 58
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T22:20:06.999353Z",
     "start_time": "2025-05-21T22:20:06.950850Z"
    }
   },
   "cell_type": "code",
   "source": [
    "phone_detect = relations_shared_between_clients('Phone','HAS_PHONE')\n",
    "phone_detect"
   ],
   "id": "c92a7497e30a247d",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "               c1.name            c2.name\n",
       "0         Evan Pacheco        David Klein\n",
       "1     Tristan Griffith        David Klein\n",
       "2          David Klein       Evan Pacheco\n",
       "3     Tristan Griffith       Evan Pacheco\n",
       "4          David Klein   Tristan Griffith\n",
       "..                 ...                ...\n",
       "715        Lily Hunter       Xavier Welch\n",
       "716  Elizabeth Sanford    Aubrey Odonnell\n",
       "717    Aubrey Odonnell  Elizabeth Sanford\n",
       "718        Emma Nieves      Austin Norman\n",
       "719      Austin Norman        Emma Nieves\n",
       "\n",
       "[720 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c1.name</th>\n",
       "      <th>c2.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Evan Pacheco</td>\n",
       "      <td>David Klein</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Tristan Griffith</td>\n",
       "      <td>David Klein</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>David Klein</td>\n",
       "      <td>Evan Pacheco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Tristan Griffith</td>\n",
       "      <td>Evan Pacheco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>David Klein</td>\n",
       "      <td>Tristan Griffith</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>715</th>\n",
       "      <td>Lily Hunter</td>\n",
       "      <td>Xavier Welch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>716</th>\n",
       "      <td>Elizabeth Sanford</td>\n",
       "      <td>Aubrey Odonnell</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>717</th>\n",
       "      <td>Aubrey Odonnell</td>\n",
       "      <td>Elizabeth Sanford</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>718</th>\n",
       "      <td>Emma Nieves</td>\n",
       "      <td>Austin Norman</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>719</th>\n",
       "      <td>Austin Norman</td>\n",
       "      <td>Emma Nieves</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>720 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 57
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T22:22:10.517928Z",
     "start_time": "2025-05-21T22:22:10.422812Z"
    }
   },
   "cell_type": "code",
   "source": [
    "email_detect = relations_shared_between_clients('Email', 'HAS_EMAIL')\n",
    "email_detect"
   ],
   "id": "6984013736d22ff3",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "              c1.name           c2.name\n",
       "0     Taylor Morrison   Xavier Morrison\n",
       "1     Xavier Morrison   Taylor Morrison\n",
       "2      Lily Nicholson  Thomas Nicholson\n",
       "3    Thomas Nicholson    Lily Nicholson\n",
       "4        Nevaeh Weeks  Charlotte Graham\n",
       "..                ...               ...\n",
       "733     Andrew Prince    Mason Saunders\n",
       "734       Austin Dale    Parker Lambert\n",
       "735    Parker Lambert       Austin Dale\n",
       "736       Jaxon Sykes   Carson Jennings\n",
       "737   Carson Jennings       Jaxon Sykes\n",
       "\n",
       "[738 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c1.name</th>\n",
       "      <th>c2.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Taylor Morrison</td>\n",
       "      <td>Xavier Morrison</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Xavier Morrison</td>\n",
       "      <td>Taylor Morrison</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Lily Nicholson</td>\n",
       "      <td>Thomas Nicholson</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Thomas Nicholson</td>\n",
       "      <td>Lily Nicholson</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Nevaeh Weeks</td>\n",
       "      <td>Charlotte Graham</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>733</th>\n",
       "      <td>Andrew Prince</td>\n",
       "      <td>Mason Saunders</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>734</th>\n",
       "      <td>Austin Dale</td>\n",
       "      <td>Parker Lambert</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>735</th>\n",
       "      <td>Parker Lambert</td>\n",
       "      <td>Austin Dale</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>736</th>\n",
       "      <td>Jaxon Sykes</td>\n",
       "      <td>Carson Jennings</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>737</th>\n",
       "      <td>Carson Jennings</td>\n",
       "      <td>Jaxon Sykes</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>738 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 59
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "#### Clients linked to same mule account",
   "id": "8d78a485c9ca8abb"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T22:26:30.750570Z",
     "start_time": "2025-05-21T22:26:29.700721Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def linked_through_mule_or_fraud():\n",
    "    query = \"\"\"\n",
    "    MATCH (c1:Client)-[:PERFORMED]->(:Transaction)-[:TO]->(m:Mule)<-[:TO]-(:Transaction)<-[:PERFORMED]-(c2:Client)\n",
    "    WHERE c1 <> c2\n",
    "    RETURN c1.name, c2.name, m.name\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "mule_relations = linked_through_mule_or_fraud()\n",
    "mule_relations"
   ],
   "id": "499ce0c3af298974",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "               c1.name              c2.name            m.name\n",
       "0       Isabella Cline  Christopher Russell      Evan Pacheco\n",
       "1       Isabella Cline         Alyssa Moore      Evan Pacheco\n",
       "2       Isabella Cline         Levi Carroll      Evan Pacheco\n",
       "3       Isabella Cline         Jack Vazquez      Evan Pacheco\n",
       "4       Isabella Cline    Elizabeth Freeman      Evan Pacheco\n",
       "...                ...                  ...               ...\n",
       "28543  Savannah Juarez       Aaliyah Sharpe  Gabriella Crosby\n",
       "28544    Caleb Spencer      Savannah Juarez  Gabriella Crosby\n",
       "28545    Caleb Spencer       Aaliyah Sharpe  Gabriella Crosby\n",
       "28546   Aaliyah Sharpe      Savannah Juarez  Gabriella Crosby\n",
       "28547   Aaliyah Sharpe        Caleb Spencer  Gabriella Crosby\n",
       "\n",
       "[28548 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c1.name</th>\n",
       "      <th>c2.name</th>\n",
       "      <th>m.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Isabella Cline</td>\n",
       "      <td>Christopher Russell</td>\n",
       "      <td>Evan Pacheco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Isabella Cline</td>\n",
       "      <td>Alyssa Moore</td>\n",
       "      <td>Evan Pacheco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Isabella Cline</td>\n",
       "      <td>Levi Carroll</td>\n",
       "      <td>Evan Pacheco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Isabella Cline</td>\n",
       "      <td>Jack Vazquez</td>\n",
       "      <td>Evan Pacheco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Isabella Cline</td>\n",
       "      <td>Elizabeth Freeman</td>\n",
       "      <td>Evan Pacheco</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28543</th>\n",
       "      <td>Savannah Juarez</td>\n",
       "      <td>Aaliyah Sharpe</td>\n",
       "      <td>Gabriella Crosby</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28544</th>\n",
       "      <td>Caleb Spencer</td>\n",
       "      <td>Savannah Juarez</td>\n",
       "      <td>Gabriella Crosby</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28545</th>\n",
       "      <td>Caleb Spencer</td>\n",
       "      <td>Aaliyah Sharpe</td>\n",
       "      <td>Gabriella Crosby</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28546</th>\n",
       "      <td>Aaliyah Sharpe</td>\n",
       "      <td>Savannah Juarez</td>\n",
       "      <td>Gabriella Crosby</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28547</th>\n",
       "      <td>Aaliyah Sharpe</td>\n",
       "      <td>Caleb Spencer</td>\n",
       "      <td>Gabriella Crosby</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>28548 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 60
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T22:40:03.983939Z",
     "start_time": "2025-05-21T22:40:03.390905Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def create_fraud_graph():\n",
    "    query = \"\"\"\n",
    "    CALL gds.graph.project.cypher(\n",
    "    'fraudGraph',\n",
    "    'MATCH (c:Client) RETURN id(c) AS id',\n",
    "    '\n",
    "    MATCH (c1:Client)-[:HAS_SSN]->(ssn:SSN)<-[:HAS_SSN]-(c2:Client)\n",
    "    WHERE id(c1) < id(c2)\n",
    "    RETURN id(c1) AS source, id(c2) AS target\n",
    "    UNION\n",
    "    MATCH (c1:Client)-[:HAS_EMAIL]->(e:Email)<-[:HAS_EMAIL]-(c2:Client)\n",
    "    WHERE id(c1) < id(c2)\n",
    "    RETURN id(c1) AS source, id(c2) AS target\n",
    "    UNION\n",
    "    MATCH (c1:Client)-[:HAS_PHONE]->(p:Phone)<-[:HAS_PHONE]-(c2:Client)\n",
    "    WHERE id(c1) < id(c2)\n",
    "    RETURN id(c1) AS source, id(c2) AS target\n",
    "    '\n",
    "    )\n",
    "    \"\"\"\n",
    "    graph_result = cypher_query_read_executor(query)\n",
    "    return graph_result\n",
    "\n",
    "client_graph = create_fraud_graph()"
   ],
   "id": "bbabc189681c9a38",
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated procedure. ('gds.graph.project.cypher' has been replaced by 'gds.graph.project Cypher projection as an aggregation function')} {position: line: 2, column: 5, offset: 5} for query: \"\\n    CALL gds.graph.project.cypher(\\n    'fraudGraph',\\n    'MATCH (c:Client) RETURN id(c) AS id',\\n    '\\n    MATCH (c1:Client)-[:HAS_SSN]->(ssn:SSN)<-[:HAS_SSN]-(c2:Client)\\n    WHERE id(c1) < id(c2)\\n    RETURN id(c1) AS source, id(c2) AS target\\n    UNION\\n    MATCH (c1:Client)-[:HAS_EMAIL]->(e:Email)<-[:HAS_EMAIL]-(c2:Client)\\n    WHERE id(c1) < id(c2)\\n    RETURN id(c1) AS source, id(c2) AS target\\n    UNION\\n    MATCH (c1:Client)-[:HAS_PHONE]->(p:Phone)<-[:HAS_PHONE]-(c2:Client)\\n    WHERE id(c1) < id(c2)\\n    RETURN id(c1) AS source, id(c2) AS target\\n    '\\n    )\\n    \"\n"
     ]
    }
   ],
   "execution_count": 63
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Partie 5 : Détection de communautés (Louvain)",
   "id": "e1f03fe4597b15cd"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:30:45.928509Z",
     "start_time": "2025-05-21T21:30:45.766088Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def detect_communities():\n",
    "    query = \"\"\"\n",
    "    CALL gds.louvain.stream('clientGraph1')\n",
    "    YIELD nodeId, communityId\n",
    "    RETURN gds.util.asNode(nodeId).name AS client, communityId\n",
    "    ORDER BY communityId DESC\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "communities = detect_communities()\n",
    "communities"
   ],
   "id": "116931cde614803f",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                  client  communityId\n",
       "0        Adrian Jacobson         2432\n",
       "1     Katherine Jacobson         2431\n",
       "2        Nathaniel Myers         2430\n",
       "3           Xavier Welch         2429\n",
       "4          Elijah Warren         2428\n",
       "...                  ...          ...\n",
       "2428         Lauren Mack            4\n",
       "2429        Landon Adams            3\n",
       "2430        Faith Dotson            2\n",
       "2431       Dominic Boyer            1\n",
       "2432        Bentley Peck            0\n",
       "\n",
       "[2433 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>communityId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Adrian Jacobson</td>\n",
       "      <td>2432</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Katherine Jacobson</td>\n",
       "      <td>2431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nathaniel Myers</td>\n",
       "      <td>2430</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Xavier Welch</td>\n",
       "      <td>2429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Elijah Warren</td>\n",
       "      <td>2428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2428</th>\n",
       "      <td>Lauren Mack</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2429</th>\n",
       "      <td>Landon Adams</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2430</th>\n",
       "      <td>Faith Dotson</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2431</th>\n",
       "      <td>Dominic Boyer</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2432</th>\n",
       "      <td>Bentley Peck</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2433 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 49
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:30:54.049553Z",
     "start_time": "2025-05-21T21:30:53.905944Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def write_communities():\n",
    "    query = \"\"\"\n",
    "    CALL gds.louvain.write('clientGraph1', { writeProperty: 'community' })\n",
    "    YIELD communityCount, modularity\n",
    "    \"\"\"\n",
    "    results = cypher_query_write_executor(query)\n",
    "    # results_df = pd.DataFrame.from_records(results)\n",
    "    return results\n",
    "\n",
    "com_writing = write_communities()\n",
    "com_writing"
   ],
   "id": "9ccf8b480104c985",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1f894017500>"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 50
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:31:06.624495Z",
     "start_time": "2025-05-21T21:31:06.533366Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def show_communities():\n",
    "    query = \"\"\"\n",
    "    MATCH (c:Client)\n",
    "    RETURN c.name, c.community\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "client_communities = show_communities()\n",
    "client_communities"
   ],
   "id": "fd48a9ad4fb415fa",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                  c.name  c.community\n",
       "0           Bentley Peck            0\n",
       "1          Dominic Boyer            1\n",
       "2           Faith Dotson            2\n",
       "3           Landon Adams            3\n",
       "4            Lauren Mack            4\n",
       "...                  ...          ...\n",
       "2428       Elijah Warren         2428\n",
       "2429        Xavier Welch         2429\n",
       "2430     Nathaniel Myers         2430\n",
       "2431  Katherine Jacobson         2431\n",
       "2432     Adrian Jacobson         2432\n",
       "\n",
       "[2433 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c.name</th>\n",
       "      <th>c.community</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bentley Peck</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dominic Boyer</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Faith Dotson</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Landon Adams</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lauren Mack</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2428</th>\n",
       "      <td>Elijah Warren</td>\n",
       "      <td>2428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2429</th>\n",
       "      <td>Xavier Welch</td>\n",
       "      <td>2429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2430</th>\n",
       "      <td>Nathaniel Myers</td>\n",
       "      <td>2430</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2431</th>\n",
       "      <td>Katherine Jacobson</td>\n",
       "      <td>2431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2432</th>\n",
       "      <td>Adrian Jacobson</td>\n",
       "      <td>2432</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2433 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 51
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### page rank",
   "id": "99036c0e00cfd7bb"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:31:18.924092Z",
     "start_time": "2025-05-21T21:31:18.803580Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def detect_suspect_nodes_with_pagerank():\n",
    "    query = \"\"\"\n",
    "    CALL gds.pageRank.stream('clientGraph1')\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).name AS client, score\n",
    "    ORDER BY score DESC\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "suspect_nodes_w_pagerank = detect_suspect_nodes_with_pagerank()\n",
    "suspect_nodes_w_pagerank"
   ],
   "id": "c6645e0011fc8a10",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "              client  score\n",
       "0       Bentley Peck   0.15\n",
       "1      Dominic Boyer   0.15\n",
       "2       Faith Dotson   0.15\n",
       "3       Landon Adams   0.15\n",
       "4        Lauren Mack   0.15\n",
       "...              ...    ...\n",
       "2428    Samuel Ellis   0.15\n",
       "2429    Alexa Rhodes   0.15\n",
       "2430  Ariana Charles   0.15\n",
       "2431     Zoey Mendez   0.15\n",
       "2432      Dylan Gray   0.15\n",
       "\n",
       "[2433 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bentley Peck</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dominic Boyer</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Faith Dotson</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Landon Adams</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lauren Mack</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2428</th>\n",
       "      <td>Samuel Ellis</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2429</th>\n",
       "      <td>Alexa Rhodes</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2430</th>\n",
       "      <td>Ariana Charles</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2431</th>\n",
       "      <td>Zoey Mendez</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2432</th>\n",
       "      <td>Dylan Gray</td>\n",
       "      <td>0.15</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2433 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 52
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T21:31:33.019844Z",
     "start_time": "2025-05-21T21:31:32.850879Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def detect_suspect_nodes_with_betweenness():\n",
    "    query = \"\"\"\n",
    "    CALL gds.betweenness.stream('clientGraph1')\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).name AS client, score\n",
    "    ORDER BY score DESC\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "suspect_nodes_w_betweenness = detect_suspect_nodes_with_betweenness()\n",
    "suspect_nodes_w_betweenness"
   ],
   "id": "f52f65ae579c94fc",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "              client  score\n",
       "0       Bentley Peck    0.0\n",
       "1      Dominic Boyer    0.0\n",
       "2       Faith Dotson    0.0\n",
       "3       Landon Adams    0.0\n",
       "4        Lauren Mack    0.0\n",
       "...              ...    ...\n",
       "2428    Samuel Ellis    0.0\n",
       "2429    Alexa Rhodes    0.0\n",
       "2430  Ariana Charles    0.0\n",
       "2431     Zoey Mendez    0.0\n",
       "2432      Dylan Gray    0.0\n",
       "\n",
       "[2433 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bentley Peck</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dominic Boyer</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Faith Dotson</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Landon Adams</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lauren Mack</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2428</th>\n",
       "      <td>Samuel Ellis</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2429</th>\n",
       "      <td>Alexa Rhodes</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2430</th>\n",
       "      <td>Ariana Charles</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2431</th>\n",
       "      <td>Zoey Mendez</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2432</th>\n",
       "      <td>Dylan Gray</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2433 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 53
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### 7-Similarity comparison",
   "id": "f3b52d899694203b"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T23:05:48.922979Z",
     "start_time": "2025-05-21T23:05:48.815768Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def similarity_comparison():\n",
    "    query = \"\"\"\n",
    "    CALL gds.nodeSimilarity.stream('fraudGraph')\n",
    "    YIELD node1, node2, similarity\n",
    "    RETURN\n",
    "    gds.util.asNode(node1).name AS client1,\n",
    "    gds.util.asNode(node2).name AS client2,\n",
    "    similarity\n",
    "    ORDER BY similarity DESC\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "similarities = similarity_comparison()\n",
    "similarities"
   ],
   "id": "53a2321b3e28ff71",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                 client1           client2  similarity\n",
       "0             Kevin Koch  Isabella Salinas    1.000000\n",
       "1       Isabella Salinas        Kevin Koch    1.000000\n",
       "2     Charlotte Bradshaw       David Klein    1.000000\n",
       "3         Josiah Sargent   Jason Valentine    1.000000\n",
       "4            Zoe Hickman     Ethan Justice    1.000000\n",
       "...                  ...               ...         ...\n",
       "1209      Robert Clayton       David Poole    0.125000\n",
       "1210        Jaxon Dudley     Lauren Hayden    0.111111\n",
       "1211       Lauren Hayden      Jaxon Dudley    0.111111\n",
       "1212     Carson Jennings        Ella Dixon    0.111111\n",
       "1213          Ella Dixon   Carson Jennings    0.111111\n",
       "\n",
       "[1214 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client1</th>\n",
       "      <th>client2</th>\n",
       "      <th>similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Kevin Koch</td>\n",
       "      <td>Isabella Salinas</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Isabella Salinas</td>\n",
       "      <td>Kevin Koch</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Charlotte Bradshaw</td>\n",
       "      <td>David Klein</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Josiah Sargent</td>\n",
       "      <td>Jason Valentine</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Zoe Hickman</td>\n",
       "      <td>Ethan Justice</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1209</th>\n",
       "      <td>Robert Clayton</td>\n",
       "      <td>David Poole</td>\n",
       "      <td>0.125000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1210</th>\n",
       "      <td>Jaxon Dudley</td>\n",
       "      <td>Lauren Hayden</td>\n",
       "      <td>0.111111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1211</th>\n",
       "      <td>Lauren Hayden</td>\n",
       "      <td>Jaxon Dudley</td>\n",
       "      <td>0.111111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1212</th>\n",
       "      <td>Carson Jennings</td>\n",
       "      <td>Ella Dixon</td>\n",
       "      <td>0.111111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1213</th>\n",
       "      <td>Ella Dixon</td>\n",
       "      <td>Carson Jennings</td>\n",
       "      <td>0.111111</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1214 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 65
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T23:08:22.245218Z",
     "start_time": "2025-05-21T23:08:21.903821Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def create_bipartite_graph():\n",
    "    query = \"\"\"\n",
    "    CALL gds.graph.project(\n",
    "    'bipartiteFraudGraph',\n",
    "    ['Client', 'Phone', 'Email', 'SSN'],\n",
    "    {\n",
    "        HAS_PHONE: {\n",
    "        type: 'HAS_PHONE',\n",
    "        orientation: 'UNDIRECTED'\n",
    "        },\n",
    "        HAS_EMAIL: {\n",
    "        type: 'HAS_EMAIL',\n",
    "        orientation: 'UNDIRECTED'\n",
    "        },\n",
    "        HAS_SSN: {\n",
    "        type: 'HAS_SSN',\n",
    "        orientation: 'UNDIRECTED'\n",
    "        }\n",
    "    }\n",
    "    )\n",
    "    \"\"\"\n",
    "    graph_result = cypher_query_read_executor(query)\n",
    "    return graph_result\n",
    "\n",
    "bipartite_graph = create_bipartite_graph()"
   ],
   "id": "d96272feb487a9b4",
   "outputs": [],
   "execution_count": 66
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T23:10:09.324373Z",
     "start_time": "2025-05-21T23:10:09.291831Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def confirm_graphs():\n",
    "    query=\"\"\"\n",
    "    CALL gds.graph.list()\n",
    "    YIELD graphName, nodeCount, relationshipCount, schema;\n",
    "    \"\"\"\n",
    "    results = cypher_query_read_executor(query)\n",
    "    results_df = pd.DataFrame.from_records(results)\n",
    "    return results_df\n",
    "\n",
    "graphs = confirm_graphs()\n",
    "graphs"
   ],
   "id": "1f9ada8c3007441e",
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated field from a procedure. ('schema' returned by 'gds.graph.list' is deprecated.)} {position: line: 3, column: 52, offset: 78} for query: '\\n    CALL gds.graph.list()\\n    YIELD graphName, nodeCount, relationshipCount, schema;\\n    '\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "             graphName  nodeCount  relationshipCount  \\\n",
       "0  bipartiteFraudGraph       9134              14598   \n",
       "1           fraudGraph       2433                759   \n",
       "\n",
       "                                              schema  \n",
       "0  {'graphProperties': {}, 'nodes': {'Phone': {},...  \n",
       "1  {'graphProperties': {}, 'nodes': {'__ALL__': {...  "
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>relationshipCount</th>\n",
       "      <th>schema</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>bipartiteFraudGraph</td>\n",
       "      <td>9134</td>\n",
       "      <td>14598</td>\n",
       "      <td>{'graphProperties': {}, 'nodes': {'Phone': {},...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>fraudGraph</td>\n",
       "      <td>2433</td>\n",
       "      <td>759</td>\n",
       "      <td>{'graphProperties': {}, 'nodes': {'__ALL__': {...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 67
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T23:32:18.368915Z",
     "start_time": "2025-05-21T23:31:41.795869Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_graph_data():\n",
    "    query = \"\"\"\n",
    "    MATCH (n)-[r]->(m)\n",
    "    RETURN id(n) AS source, id(m) AS target,\n",
    "           labels(n)[0] AS source_label, labels(m)[0] AS target_label,\n",
    "           type(r) AS relationship\n",
    "    \"\"\"\n",
    "    with driver.session(database='frauddetect') as session:\n",
    "        results = session.run(query)\n",
    "        return [record.data() for record in results]\n",
    "\n",
    "graph_data = get_graph_data()"
   ],
   "id": "fe2240f763f4515b",
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated function: `id`.} {position: line: 3, column: 12, offset: 35} for query: '\\n    MATCH (n)-[r]->(m)\\n    RETURN id(n) AS source, id(m) AS target,\\n           labels(n)[0] AS source_label, labels(m)[0] AS target_label,\\n           type(r) AS relationship\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated function: `id`.} {position: line: 3, column: 29, offset: 52} for query: '\\n    MATCH (n)-[r]->(m)\\n    RETURN id(n) AS source, id(m) AS target,\\n           labels(n)[0] AS source_label, labels(m)[0] AS target_label,\\n           type(r) AS relationship\\n    '\n"
     ]
    }
   ],
   "execution_count": 69
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-05-21T23:43:09.301159Z",
     "start_time": "2025-05-21T23:43:05.769283Z"
    }
   },
   "cell_type": "code",
   "source": [
    "G = nx.DiGraph()\n",
    "\n",
    "# Add nodes and edges\n",
    "for row in graph_data:\n",
    "    G.add_node(row['source'], label=row['source_label'])\n",
    "    G.add_node(row['target'], label=row['target_label'])\n",
    "    G.add_edge(row['source'], row['target'], label=row['relationship'])\n"
   ],
   "id": "fbf43f8658f2bb1d",
   "outputs": [],
   "execution_count": 75
  },
  {
   "metadata": {
    "jupyter": {
     "is_executing": true
    },
    "ExecuteTime": {
     "start_time": "2025-05-21T23:43:35.955093Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Layout\n",
    "pos = nx.spring_layout(G, seed=42)\n",
    "\n",
    "# Edges\n",
    "edge_x = []\n",
    "edge_y = []\n",
    "for edge in G.edges():\n",
    "    x0, y0 = pos[edge[0]]\n",
    "    x1, y1 = pos[edge[1]]\n",
    "    edge_x += [x0, x1, None]\n",
    "    edge_y += [y0, y1, None]\n",
    "\n",
    "edge_trace = go.Scatter(\n",
    "    x=edge_x, y=edge_y,\n",
    "    line=dict(width=0.5, color='#888'),\n",
    "    hoverinfo='none',\n",
    "    mode='lines'\n",
    ")\n",
    "\n",
    "# Nodes\n",
    "node_x = []\n",
    "node_y = []\n",
    "node_text = []\n",
    "for node in G.nodes(data=True):\n",
    "    x, y = pos[node[0]]\n",
    "    node_x.append(x)\n",
    "    node_y.append(y)\n",
    "    node_text.append(node[1]['label'])\n",
    "\n",
    "node_trace = go.Scatter(\n",
    "    x=node_x, y=node_y,\n",
    "    mode='markers+text',\n",
    "    hoverinfo='text',\n",
    "    text=node_text,\n",
    "    marker=dict(\n",
    "        showscale=True,\n",
    "        colorscale='YlGnBu',\n",
    "        color=[len(list(G.neighbors(n))) for n in G.nodes()],\n",
    "        size=20,\n",
    "        colorbar=dict(\n",
    "            thickness=15,\n",
    "            title='Number of Connections',\n",
    "            xanchor='left',\n",
    "            titleside='right'\n",
    "        ),\n",
    "        line_width=2)\n",
    ")\n",
    "\n",
    "# Final Plot\n",
    "fig = go.Figure(data=[edge_trace, node_trace],\n",
    "             layout=go.Layout(\n",
    "                title='<br>Graph Visualisation from Neo4j',\n",
    "                titlefont_size=16,\n",
    "                showlegend=False,\n",
    "                hovermode='closest',\n",
    "                margin=dict(b=20,l=5,r=5,t=40),\n",
    "                xaxis=dict(showgrid=False, zeroline=False),\n",
    "                yaxis=dict(showgrid=False, zeroline=False))\n",
    ")\n",
    "\n",
    "fig.show()\n"
   ],
   "id": "2b85aa9a7801a6f1",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "19db12ca61e56d0a"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
